# Используем официальный образ Golang в качестве базового образа
FROM golang:1.22.5



# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы go.mod и go.sum и устанавливаем зависимости
COPY go.mod go.sum ./
RUN go mod tidy

# Копируем исходный код
COPY . .

# Компилируем приложение
RUN go build -o main .

CMD ["./main"]

## Используем минимальный образ для конечного контейнера
#FROM alpine:latest
#
### Устанавливаем рабочую директорию внутри контейнера
#WORKDIR /app
##
### Копируем бинарный файл из первого этапа
##COPY --from=0 /app/main .
#
## Указываем команду по умолчанию для запуска контейнера
#CMD ["./main"]
